Revit 2027 API
WallSweepOrientation Enumeration
 Represents the orientation of horizonally placed sweep's profile relative to the wall side face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum WallSweepOrientation
Public Enumeration WallSweepOrientation
public enum class WallSweepOrientation
type WallSweepOrientation
Members
Member name | Value | Description
Horizontal | 0 |  Profile is oriented horizontally regardless of wall slant angle
Perpendicular | 1 |  Profile is perpendicular to the wall side face
See Also
Reference
Autodesk.Revit.DB Namespace